{

  "cars": [

    {

    "id": 1,

    "name": "Ferrari 488 Spider 2018",

    "acceleration": "2.8 seconds",

    "features": "Ferrari tends to focus on the job at hand, which is to deliver world-class performance and driver engagement, and as such, the features list tends to suffer somewhat. The 488 Spider doesn't offer you the same type of gear you'd find in a Mercedes-AMG drop-top, but there's enough to make it liveable. The exterior features standard carbon-ceramic brakes hidden behind exquisite 20-inch alloy wheels, the fastest fold-down roof Ferrari has ever produced, and heated side mirrors. Inside, you can expect to find a set of leather sports seats. You also get climate control and cruise control, as well as a reverse parking camera with reverse sensors. The 488 Spider also features keyless ignition, which is activated from the flat-bottomed steering wheel. Assistance features such as slip-angle management and carbon-ceramic brakes trim hairy situations."

  },

  {

    "id": 2,

    "name": "Porsche 911 Turbo S 2015",

    "acceleration": "2.6 seconds",

    "features": "Hanging out in the rear of both the Turbo and Turbo S is a twin-turbocharged 3.8-liter flat-six engine that makes up to 640 horsepower in the more powerful of the two variants. Porsche claims a zero-to-60-mph time of 2.6 seconds for the Turbo S. We had a chance to ride along with Porsche's development testing engineers in Europe where we were subjected to such blistering acceleration from the passenger's seat, but we have yet to slide behind the wheel. All-wheel drive will be standard and shifts are handled by an eight-speed dual-clutch automatic transmission."


  },

  {

    "id": 3,

    "name": "Lamborghini Aventador SVJ 2019",

    "acceleration": "2.7 seconds",

    "features": "The Lamborghini Aventador SVJ, or Super Veloce Jota, which translates into Superfast track edition, is the most fierce and ferocious Lambo built to date, and doesn’t only look good, but has the go to match. Standard exterior features include LED headlights, massive carbon-ceramic brakes, adaptive suspension, all-wheel-steering, and an active aero front lip, rear spoiler and rear air intake. The SVJ’s engine receives a few upgrades in the form of titanium valves, a reworked head and exhaust manifold, and now produces 759 hp."

  },

  {

    "id": 4,

    "name": "Chevrolet Corvette ZR1 2019",

    "acceleration": "2.9 seconds",

    "features": "The 2019 Chevrolet Corvette ZR1 features a 6.2-liter supercharged LT5 V-8 engine capable of 755 hp and 715 pound-feet of torque and a top speed of more than 210 mph -- making it the fastest, most powerful production Corvette ever. The fourth-generation ZR1 features several more aggressive design features than the current top-tier Corvette Z06, including a more sculpted hood, larger and lower air intake grilles above a more prominent splitter and a massive rear spoiler. For the first time, the ZR1 is available with an optional eight-speed, paddle-shift automatic transmission. A seven-speed manual transmission will be standard. Chevrolet will unwrap the eighth-generation Corvette, featuring a midengine layout for the first time, in July. Here's a roundup of snippets of Corvette ZR1 reviews from the automotive media."
    
  },

  {

    "id": 5,

    "name": "McLaren 720S Spider 2020",

    "acceleration": "2.6 seconds",

    "features": "Supercars such as the 720S have the performance of a Formula 1 race car and the body of a fighter jet. Its innate ability to combine both characteristics are what make this McLaren so fantastic. Dihedral doors and a skull-like expression converge on its convex bodywork, which hides an insanely powerful 710-hp twin-turbo V-8 powertrain. But this mid-engined exotic—available as a slippery coupe or an exposed convertible—is more than a straight-line speedster. Both body styles deliver world-class steering feedback, surprising ride dexterity, and relentless stopping power. Along with innumerable custom options, the 2020 720S epitomizes the special relationship between car and driver."

  }

  ],

  "profile": {

    "name": "typicode"

  }

}
