{
  "recipes": [
    {
    "id": 1,
    "name": "Vegetable Dim Sum",
    "ingredients": "1/2 pound firm tofu, 1/2 cup coarsely grated carrots, 1/2 cup shredded Napa cabbage, 2 tablespoons finely chopped red pepper, 2 tablespoons finely chopped scallions, 2 teaspoons finely minced fresh ginger, 1 tablespoon chopped cilantro leaves, 1 tablespoon soy sauce, 1 tablespoon hoisin sauce, 2 teaspoons sesame oil, 1 egg, lightly beaten, 1 teaspoon salt, 1/4 teaspoon black pepper, 35 to 40 small wonton wrappers, Non-stick vegetable spray, for the steamer",
 "instructions": "Preheat the oven to 200 degrees F. 2.Cut the tofu in half horizontally and lay between layers of paper towels. Place on a plate, top with another plate, and place a weight on top (a 14-ounce can of vegetables works well). Let stand 20 minutes. After 20 minutes, cut the tofu into 1/4-inch cubes and place in a large mixing bowl. Add the carrots, cabbage, red pepper, scallions, ginger, cilantro, soy sauce, hoisin, sesame oil, egg, salt, and pepper. Lightly stir to combine. To form the dumplings, remove 1 wonton wrapper from the package, covering the others with a damp cloth. Brush the edges of the wrapper lightly with water. Place 1/2 rounded teaspoon of the tofu mixture in the center of the wrapper. Shape as desired. Set on a sheet pan and cover with a damp cloth. Repeat procedure until all of the filling is gone. Using a steaming apparatus of your choice, bring 1/4 to 1/2-inch of water to a simmer over medium heat. Spray the steamer's surface lightly with the non-stick vegetable spray to prevent sticking. Place as many dumplings as will fit into a steamer, without touching each other. Cover and steam for 10 to 12 minutes over medium heat. Remove the dumplings from the steamer to a heatproof platter and place in oven to keep warm. Repeat until all dumplings are cooked."
  },
  {
    "id": 2,
    "name": "Blueberry Pancakes",
    "ingredients": "2 cups all-purpose flour, 3 tablespoons sugar, 1 tablespoon baking powder, Fine salt, 1 1/2 cups unsweetened plain soy milk, 1/3 cup virgin coconut oil, melted, 1 teaspoon pure vanilla extract, 4 teaspoons vegetable oil, Maple syrup, nut butter or jam, for serving, 1/2 of blueberries",
    "instructions": "Preheat the oven to 250 degrees F. Whisk together the flour, sugar, baking powder and 1 teaspoon salt in a medium bowl. Whisk together the soy milk, coconut oil and vanilla in a second medium bowl (don't worry if the coconut oil clumps). Add the soy milk mixture to the flour mixture and gently fold until just combined (it's OK if there are lumps). Add in blueberries. Heat a nonstick griddle or large nonstick skillet over medium-low heat. Add 1 teaspoon of the vegetable oil. Once the pan is hot, add three 1/4-cup mounds of batter, evenly spaced, and cook until the pancakes begin to bubble and are golden brown, 4 to 5 minutes. Carefully flip the pancakes and cook until the underside is golden brown and the pancakes are cooked through, 3 to 4 minutes (adjust the heat as necessary for consistent browning). Repeat with the remaining vegetable oil and batter. Transfer the cooked pancakes to the oven to keep warm. Serve 2 per person with maple syrup, nut butter, jam or your favorite topping."
  },
  {
    "id": 3,
    "name": "Lemon Pasta",
    "ingredients": "12 ounces eggless pasta, 2 cups unsweetened soy or almond milk, 4 ounces soy cream cheese, 3 tablespoons blanched sliced almonds, 3 tablespoons nutritional yeast, plus more for sprinkling, 1 teaspoon finely grated lemon zest, Kosher salt and freshly ground black pepper, 2 tablespoons extra-virgin olive oil, 3 cloves garlic, finely chopped, 1/2 cup loosely packed parsley leaves, chopped",
    "instructions": "Bring a large pot of water to a boil and cook the pasta according to package directions. Strain, reserving 1 cup of the pasta cooking water. Add the soy milk, soy cream cheese, almonds, nutritional yeast, lemon zest, 1 teaspoon salt and 1/4 teaspoon pepper to a blender and process until smooth. Heat the oil and garlic in a large skillet over medium heat, stirring until the garlic just starts to sizzle and softens, about 1 minute. Add the soy milk mixture and 1/2 cup of the reserved pasta water, bring to a simmer and cook until thick and creamy, about 8 minutes. Remove from the heat, add the pasta and parsley and toss to combine. Thin out with a little more pasta water if needed. Divide the pasta among four bowls and sprinkle each with some nutritional yeast and a few grinds of pepper."
  },
  {
    "id": 4,
    "name": "Spinach Dip",
    "ingredients": "2 tablespoons extra-virgin olive oil, 2 cloves garlic, minced, 2 (6-ounce) bags baby spinach, 1 (15-ounce) can cannelloni beans, drained and rinsed, 1 tablespoon fresh lemon juice, 1 tablespoon balsamic vinegar, 1 teaspoon kosher salt, 1/4 teaspoon freshly ground black pepper",
    "instructions": "In a large nonstick skillet, heat 1 tablespoon of the oil, over medium heat. Add the garlic and cook until fragrant, about 1 minute. Add 1/2 of the spinach and cook for 2 minutes until wilted. Repeat with the remaining spinach. Let the mixture cool for a few minutes. Place the remaining olive oil, spinach mixture, cannelloni beans, lemon juice, balsamic vinegar, salt, and pepper in the bowl of a food processor. Blend until the mixture is smooth. Transfer to a small serving bowl. Serve with endive spears, crostini or pita chips."
  },
  {
    "id": 5,
    "name": "Blackberry Popsicles",
    "ingredients": "2 cups blackberries, hulled and sliced, 1/3 cup sugar, 2 teaspoons pure vanilla extract, 1 cup vegan vanilla yogurt",
    "instructions": "Add the berries to a bowl and toss with the sugar and vanilla. Let sit out for 15 to 20 minutes so they get all juicy. Add to a blender or food processor, along with the vegan yogurt, and puree until smooth. Divide the mixture into 6 popsicles molds. Freeze until firm, about 4 hours."
  }
  ],
  "profile": {
    "name": "typicode"
  }
}
